# "1st program".
print(9**0.5*5)# Выводим на экран(в консоль) результат: возведение числа 9 в степень 0.5, после умножение на 5.
# "2nd program".
print(type(9.99>9.98 and 1000!=1000.1)) # Узнаём тип строки - логический(bool)
print (9.99>9.98 and 1000!=1000.1)# Убеждаемся, что 9.99 больше 9.98 и 1000 не равно 1000.1 одновременно, выведете результат на экран(в консоль)
# "3rd program".
print(2*2+2) # Выводим на экран(в консоль) 2 умноженное на 2 плюс 2 без приоритета.
print(2*(2+2)) # Выводим на экран(в консоль) 2 умноженное на 2 плюс 2 с приоритетом для сложения.
print((2*2+2)==2*(2+2)) # Выводим на экран(в консоль) результат сравнения этих двух выражений.
# "4th program".
print(type('123.456'))# Узнаём тип строки
print(type(float('123.456')))#  и переводим выражение в цифровое значение
print(123.456*10) # Умножаем на 10, чтобы сместить 4 в целую часть.
print(int(1234.56)) # отделяем целую часть числа от дробной.
print(float(1234//10*10)) # получаем целочисленное деление и умножаем с остатком
print(int(int(1234.56)-float(1234//10*10))) # у разницы отделяем целую часть числа от дробной и получаем первую цифру после запятой
























